% Параметры модели квадрокоптера
m = 1;              % масса (кг)
Ix = 8.1e-3;        % момент инерции по x
Iy = 8.1e-3;        % момент инерции по y
Iz = 14.2e-3;       % момент инерции по z
g = 9.81;           % ускорение свободного падения

% Матрицы состояния (из статьи)
A = [0 1 zeros(1,10);
    zeros(1, 8) g zeros(1, 3);
    zeros(1,3) 1 zeros(1, 8);
    zeros(1,6) -g zeros(1,5);
    zeros(1, 5) 1 zeros(1, 6);
    zeros(1, 12);
    zeros(1, 7) 1 zeros(1,4);
    zeros(1, 12);
    zeros(1, 9) 1 zeros(1, 2);
    zeros(1, 12);
    zeros(1, 11) 1;
    zeros(1, 12)];

disp(size(A))

B = zeros(12,4);
B(6,1)  = 1/m;
B(8,2)  = 1/Ix;
B(10,3) = 1/Iy;
B(12,4) = 1/Iz;

% Матрица выхода
C = [1 0 0 0 0 0 0 0 0 0 0 0;   % x
     0 0 1 0 0 0 0 0 0 0 0 0;   % y
     0 0 0 0 1 0 0 0 0 0 0 0;   % z
     0 0 0 0 0 0 0 0 0 0 1 0];  % yaw
% Весовые матрицы
Q = 0.1 * eye(12);
R = diag([0.1, 10, 100, 10]);  % усилие на позицию меньше, чем на ориентацию

% Вычисляем LQR gain
[K, ~, ~] = lqr(A, B, Q, R);
disp(K)

% Feedback law
% u = -K * (x - x_ref)
