m=0.65;
a=0.07;
b=0.07;
l=0.15;
c=0.02;
g=9.8;
% g=g/2;
maxDroneSpeed=40;
maxMotorSpeed=8450/60*2*pi;
R=165/1000;
Ke=11/maxMotorSpeed;
Km=Ke;
Imot=16;
J = 2.5*10^(-6);
%J = 0.005;
B = 1*10^(-5);
La = 100*10^(-6);
%La = 0.015;
ra = 0.058;
%ra = 1;
ke = 0.00734;
kt = ke;
demp = 0;
R=ra;
Ke=ke;
Km=kt;
L = La;




rho = 1.225;


Sblade=0.00525; %площадь лопасти
airDensity=1.225; %плотность воздуха
ks=1; %коэффициент подъемной силы
r=0.07; %радиус лопастей

maxU=16;
%%%%%%%%%%%%%%%%%%%%%%%%%% Рассчет некоторых постоянных %%%%%%%%%%%%%%%%%%%

S=l*c*4+a*b;

kf=ks*r^2*airDensity*Sblade/2; %коэффициент силы тяги
maxAirResistance=airDensity*maxDroneSpeed^2*S*0.5/2; %максимальное сопративление воздуха(не учитывается в модели)

%maxAirResistance
Ip=(1.8*r)^2*0.015/12; %момент инерции лопасти
Im=0.0135^2*0.045/2; %момент инерции мотора
Ix=m/3*a^2/12+2*0.045*l^2; %момент инерции относительно x
Iy=m/3*a^2/12+2*0.045*l^2; %момент инерции относительно y
Iz=m/3*a^2/4+4*0.045*l^2;  %момент инерции относительно z

params = struct();
params.N = 25;                     % горизонт предсказания
params.dt = 0.0005;                  % шаг дискретизации, например 50 мс
params.alpha = 0.1;                % шаг градиентного спуска
params.max_iters = 10;            % количество итераций оптимизации

% Физические параметры квадрокоптера
params.m = m;                    % масса (кг)
params.g = g;                   % ускорение свободного падения
params.Ix = Ix;                  % моменты инерции
params.Iy = Iy;
params.Iz = Iz;

% Ограничения на управление
params.umin = [0; -0.1; -0.1; -0.1];  % минимальные значения [T; tau_phi; tau_theta; tau_psi]
params.umax = [15; 1; 1; 11];   % максимальные значения

pType = Simulink.Bus.createObject(params);